nowhard/STM32_PILORAMA/freertos_test/protocols/proto.c
#include "proto.h"
#include "channels.h"
#include "tablo.h"
#include "tablo_parser.h"
#include "watchdog.h"
#include "buzzer.h"


#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_tim.h"
#include "stm32f4xx_usart.h"
#include "misc.h"

// FreeRTOS:
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"

 extern struct Channel  channels[];
 extern struct tablo tab;

//-----------------------------------------------------------------------------------
uint8_t   DEV_NAME[DEVICE_NAME_LENGTH_SYM] ="<<HEY, DUDE!>>";
uint8_t   NOTICE[DEVICE_DESC_MAX_LENGTH_SYM]="<-- GEOSPHERA_2014 -->";
uint8_t   VERSION[DEVICE_VER_LENGTH_SYM] ="\x30\x30\x30\x30\x31";

uint8_t   ADRESS_DEV=0xF;

uint8_t   dev_desc_len=20;
//--------------------------------global variable------------------------------------

uint8_t   	recieve_count;
uint8_t  	transf_count;
uint8_t  	buf_len;

uint8_t   crc_n_ERR;
uint8_t   COMMAND_ERR;

uint8_t   CUT_OUT_NULL;
uint8_t   PROTO_HAS_START;//была стартовая последовательность D7 29
uint8_t   frame_len=0;
//--------------------------------------------------------------------

uint8_t    *RecieveBuf;
uint8_t    *TransferBuf;

//--------------------------------------------------------------------
uint8_t    STATE_BYTE=0xC0;

uint16_t fr_err=0;

uint8_t  symbol=0xFF;

uint8_t	proto_type=PROTO_TYPE_NEW;

const uint8_t standby_frame[256]={0x3A,0x7C,0x5B,0x00,0x2E,0x2E,0x2E,0x5D,0x5B,0x01,0x2E,0x2E,0x2E,0x5D,0x5B,0x02,0x2E,0x2E,0x2E,0x5D,0x5B,0x03,0x2E,0x2E,0x2E,0x5D,0x5B,0x04,0x2E,0x2E,0x2E,0x5D,0x5B,0x05,0x2E,0x2E,0x2E,0x5D,0x5B,0x06,0x2E,0x2E,0x2E,0x5D,0x5B,0x07,0x2E,0x2E,0x2E,0x5D,0x5B,0x08,0x2E,0x2E,0x2E,0x2E,0x2E,0x5D,0x5B,0x0A,0x2E,0x2E,0x2E,0x2E,0x2E,0x5D,0x5B,0x0B,0x2E,0x2E,0x2E,0x5D,0x5B,0x0C,0x2E,0x2E,0x2E,0x2E,0x2E,0x5D,0x5B,0x0D,0x00,0x00,0x00,0xFF,0x5D,0x5B,0x0E,0x00,0x00,0x00,0xFF,0x5D,0x5B,0x0F,0x00,0x00,0x00,0xFF,0x5D,0x5B,0x10,0x00,0x00,0x00,0xFF,0x5D,0x5B,0x12,0x00,0x00,0x00,0xFF,0x5D,0x5B,0x13,0x00,0xFF,0xFF,0xFF,0x5D,0x5B,0x2A,0x07,0x5D};
const uint8_t standby_frame_2[256]={0x3A,0x7C,0x5B,0x00,' ',' ',' ',0x5D,0x5B,0x01,' ',' ',' ',0x5D,0x5B,0x02,' ',' ',' ',0x5D,0x5B,0x03,' ',' ',' ',0x5D,0x5B,0x04,' ',' ',' ',0x5D,0x5B,0x05,' ',' ',' ',0x5D,0x5B,0x06,' ',' ',' ',0x5D,0x5B,0x07,' ',' ',' ',0x5D,0x5B,0x08,' ',' ',' ',' ',' ',0x5D,0x5B,0x0A,' ',' ',' ',' ',' ',0x5D,0x5B,0x0B,' ',' ',' ',0x5D,0x5B,0x0C,' ',' ',' ',' ',' ',0x5D,0x5B,0x0D,0x00,0xFF,0xFF,0xFF,0x5D,0x5B,0x0E,0x00,0xFF,0xFF,0xFF,0x5D,0x5B,0x0F,0x00,0xFF,0xFF,0xFF,0x5D,0x5B,0x10,0x00,0xFF,0xFF,0xFF,0x5D,0x5B,0x12,0x00,0xFF,0xFF,0xFF,0x5D,0x5B,0x13,0x00,0xFF,0xFF,0xFF,0x5D,0x5B,0x2A,0x07,0x5D};
//-----------------------------------------------------------------------------------
union
{
	float result_float;
	uint8_t result_char[4];
}
sym_8_to_float;

xSemaphoreHandle xProtoSemaphore;
extern struct task_watch task_watches[];

#define RS_485_RECEIVE  USART_RS485_GPIO->BSRRH|=USART_RS485_DE; USART_RS485_GPIO->BSRRH|=USART_RS485_RE;
#define RS_485_TRANSMIT USART_RS485_GPIO->BSRRL|=USART_RS485_DE; USART_RS485_GPIO->BSRRL|=USART_RS485_RE;
//----------------------------------------------------------------------------------
uint8_t Send_Info(void);
uint8_t Node_Full_Init(void);
uint8_t Channel_List_Init(void);
uint8_t Channel_Get_Data(void);
uint8_t Channel_Set_Parameters(void);
uint8_t Channel_Set_Order_Query(void);
uint8_t Channel_Get_Data_Order(void);
uint8_t Channel_Set_State(void);
uint8_t Channel_Get_Data_Order_M2(void);
uint8_t Channel_Set_Reset_State_Flags(void);
uint8_t Channel_All_Get_Data(void);
uint8_t Channel_Set_Address_Desc(void);
uint8_t Channel_Set_Calibrate(void);
uint8_t Request_Error(uint8_t error_code);//


void ProtoBufHandling(void);
void Store_Dev_Address_Desc(void);
void Restore_Dev_Address_Desc(void);

uint8_t  CRC_Check( uint8_t *Spool,uint8_t Count);

void ProtoProcess( void *pvParameters );//
//----------------------------------------------------------------------------------
void /*USART_RS485_IRQHandler*/USART3_IRQHandler(void)
{
 	static portBASE_TYPE xHigherPriorityTaskWoken;
 	xHigherPriorityTaskWoken = pdFALSE;


 	if(USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)
   	{
 		USART_ClearITPendingBit(USART1, USART_IT_RXNE);
   		symbol=USART_ReceiveData (USART1);

   		if(recieve_count>MAX_LENGTH_REC_BUF)
   		{
   			recieve_count=0x0;
   			return;
   		}

		switch(proto_type)
		{
			case PROTO_TYPE_OLD:
			{
				if(symbol==':')
				{
					recieve_count=0x0;
				}

				tab.tablo_proto_buf[recieve_count]=symbol;
				recieve_count++;

				if(recieve_count>1)
				{
					if(tab.tablo_proto_buf[1]==(recieve_count-2))//
					{
						 USART_ITConfig(USART1, USART_IT_RXNE , DISABLE);
						xSemaphoreGiveFromISR( xProtoSemaphore, &xHigherPriorityTaskWoken );

						 if( xHigherPriorityTaskWoken != pdFALSE )
						 {
							portEND_SWITCHING_ISR( xHigherPriorityTaskWoken );
						 }
					}
				}
			}
			break;

			case PROTO_TYPE_NEW:
			{
			//--------------------------

				switch(symbol)
				{
					case (char)(0xD7):
					{
						RecieveBuf[recieve_count]=symbol;
						recieve_count++;
						CUT_OUT_NULL=1;
					}
					break;

					case (char)(0x29):
					{
						if(CUT_OUT_NULL==1)
						{
							RecieveBuf[0]=0x0;
							RecieveBuf[1]=0xD7;
							RecieveBuf[2]=0x29;
							PROTO_HAS_START=1;
							recieve_count=0x3;
						}
						else
						{
							RecieveBuf[recieve_count]=symbol;
							recieve_count++;
						}
						CUT_OUT_NULL=0;
					}
					break;

					case (char)(0x0):
					{
						if(CUT_OUT_NULL==1)	  //если после 0xD7-пропускаем
						{
							CUT_OUT_NULL=0;
						}
						else
						{
							RecieveBuf[recieve_count]=symbol;
							recieve_count++;
						}
					}
					break;

					default :
					{
						if(PROTO_HAS_START)
						{
							RecieveBuf[recieve_count]=symbol;
							recieve_count++;
							CUT_OUT_NULL=0;
						}
					}
				}

			   if(recieve_count>6)
			   {
					  if(recieve_count==6+frame_len)	  // принимаем указанное в frame_len число байт
					  {
							 USART_ITConfig(USART1, USART_IT_RXNE , DISABLE);

							 xSemaphoreGiveFromISR( xProtoSemaphore, &xHigherPriorityTaskWoken );

							 if( xHigherPriorityTaskWoken != pdFALSE )
							 {
								portEND_SWITCHING_ISR( xHigherPriorityTaskWoken );
							 }
							 CUT_OUT_NULL=0;
							 PROTO_HAS_START=0;
					  }
			   }
			   else
			   {
					   if(recieve_count==6)
					   {
							frame_len=RecieveBuf[recieve_count-1];  // получаем длину данных после заголовка
					   }
			   }
			}
		}

