nowhard/STM32_PILORAMA/freertos_test/protocols/proto.c
uint8_t Request_Error(uint8_t error_code) //
{
	TransferBuf[0]=0x00;TransferBuf[1]=0xD7;TransferBuf[2]=0x29;
    TransferBuf[3]=ADRESS_DEV;  //
    TransferBuf[7]=RecieveBuf[4]; //
    TransferBuf[4]=0xFF;  //

	TransferBuf[6]=STATE_BYTE; //
    TransferBuf[8]=error_code;
    TransferBuf[5]=0x04;	  //
    TransferBuf[9]=CRC_Check(TransferBuf,9);
	return 10;
}
//-----------------------------------------------------------------------------
void ProtoBufHandling(void) //
{
  switch(RecieveBuf[4])
  {
//---------------------------------------
  	case GET_DEV_INFO_REQ:
	{
		buf_len=Send_Info();
	}
	break;
//---------------------------------------
  	case NODE_FULL_INIT_REQ:
	{
		buf_len=Node_Full_Init();
	}
	break;
//---------------------------------------
  	case CHANNEL_LIST_INIT_REQ:
	{
		buf_len=Channel_List_Init();
	}
	break;
//---------------------------------------
	case CHANNEL_GET_DATA_REQ:
	{
		buf_len=Channel_Get_Data();
	}
	break;
	//-----------------------------------
	case CHANNEL_SET_PARAMETERS_REQ:
	{
		buf_len=Channel_Set_Parameters();
	}
	break;
	//-----------------------------------
	case CHANNEL_SET_ORDER_QUERY_REQ:
	{
		buf_len=Channel_Set_Order_Query();
	}
	break;
//----------------------------------------
	case CHANNEL_GET_DATA_ORDER_REQ:
	{
		 buf_len=Channel_Get_Data_Order();
	}
	break;
//----------------------------------------
	case CHANNEL_SET_STATE_REQ:
	{
		 buf_len=Channel_Set_State();
	}
	break;
//----------------------------------------
	case CHANNEL_GET_DATA_ORDER_M2_REQ:
	{
		 buf_len=Channel_Get_Data_Order_M2();
	}
	break;
//------------------------------------------
	case CHANNEL_SET_RESET_STATE_FLAGS_REQ:
	{
		buf_len=Channel_Set_Reset_State_Flags();
	}
	break;
//------------------------------------------
	case CHANNEL_ALL_GET_DATA_REQ:
	{
		 buf_len=Channel_All_Get_Data();
	}
	break;
//------------------------------------------
/*	case CHANNEL_SET_ADDRESS_DESC:
	{
		 buf_len=Channel_Set_Address_Desc();
	}
	break;
//------------------------------------------
	case CHANNEL_SET_CALIBRATE:
	{
		 buf_len=Channel_Set_Calibrate();
	}
	break;*/
//------------------------------------------
    default:
	{
       COMMAND_ERR=0x1;//
	   buf_len=Request_Error(FR_COMMAND_NOT_EXIST);
    }
  }

  return;
}
//-----------------------------------------------------------------------------------
void ProtoProcess( void *pvParameters )
{
	uint8_t   crc_n;
	task_watches[PROTO_TASK].task_status=TASK_IDLE;
	while(1)
	{
		task_watches[PROTO_TASK].task_status=TASK_IDLE;
		if( xProtoSemaphore != NULL )
		{

			if( xSemaphoreTake( xProtoSemaphore, ( portTickType ) PROTO_STANDBY_TIME ) == pdTRUE )
			{
				task_watches[PROTO_TASK].task_status=TASK_ACTIVE;
				switch(proto_type)
				{
					case PROTO_TYPE_OLD:
					{
						tablo_proto_parser(&tab.tablo_proto_buf);
						recieve_count=0x0;
						USART_ITConfig(USART1, USART_IT_RXNE , ENABLE);
					}
					break;

					case PROTO_TYPE_NEW:
					{
						crc_n=RecieveBuf[recieve_count-1];
						transf_count=0;
						if((CRC_Check(RecieveBuf,(recieve_count-CRC_LEN))==crc_n)&& (RecieveBuf[3]==ADRESS_DEV))
						{

							ProtoBufHandling();//

							transf_count=0;
							recieve_count=0;
							CUT_OUT_NULL=0;

							//USART_SendData(USART1,/*TransferBuf[transf_count]*/tab.uart_buf[transf_count]);
							RS_485_TRANSMIT;
							USART1->DR =TransferBuf[transf_count];
							transf_count++;//
						}
						else
						{
							crc_n_ERR=0x1;//
							USART_ITConfig(USART1, USART_IT_RXNE , ENABLE);
						}
					}
					break;
				}
				task_watches[PROTO_TASK].counter++;
			}
			else
			{
				//task_watches[PROTO_TASK].task_status=TASK_IDLE;
				tablo_proto_parser(&standby_frame_2);//
				vTaskDelay(200);
				tablo_proto_parser(&standby_frame);//
				//PROTO_HAS_START=0;
				 Proto_Init(PROTO_REINIT);
			}
		}
		task_watches[PROTO_TASK].task_status=TASK_IDLE;
	}
}
//-----------------------crc_n------------------------------------------------------------
uint8_t  CRC_Check( uint8_t  *Spool_pr,uint8_t Count_pr )
{
	uint8_t crc_n = 0;
	uint8_t  *Spool;
	uint8_t  Count ;

	Spool=Spool_pr;
	Count=Count_pr;

  		while(Count!=0x0)
        {
	        crc_n = crc_n ^ (*Spool++);//

	        crc_n = ((crc_n & 0x01) ? (uint8_t)0x80: (uint8_t)0x00) | (uint8_t)(crc_n >> 1);

	        if (crc_n & (uint8_t)0x80) crc_n = crc_n ^ (uint8_t)0x3C;
			Count--;
        }
    return crc_n;
}
 //-----------------------------------------------------------------------------------------------

